plexus-components/plexus-xfire/src/test/resources/org/codehaus/plexus/xfire/config/Echo.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="urn:Echo" 
  xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="urn:Echo">
  <wsdl:types>
    <xsd:schema targetNamespace="urn:Echo" elementFormDefault="qualified" 
      attributeFormDefault="qualified">
      <xsd:element name="echoRequest" type="xsd:string" minOccurs="1" maxOccurs="1"/>
      <xsd:element name="echoResponse" type="xsd:string" minOccurs="1" maxOccurs="1"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="echoRequest">
    <wsdl:part element="tns:echoRequest" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="echoResponse">
    <wsdl:part element="tns:echoResponse" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="EchoPortType">
    <wsdl:operation name="echo">
      <wsdl:input message="tns:echoRequest" name="echoRequest"/>
      <wsdl:output message="tns:echoResponse" name="echoResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="EchoHttpBinding" type="tns:EchoPortType">
    <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="echo">
      <wsdlsoap:operation soapAction=""/>
      <wsdl:input name="echoRequest">
        <wsdlsoap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="echoResponse">
        <wsdlsoap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="EchoWSDL">
    <wsdl:port binding="tns:EchoHttpBinding" name="EchoHttpPort">
      <wsdlsoap:address location="http://localhost:8080/xfire/services/Echo"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>