xfire-aegis/src/test/org/codehaus/xfire/message/rpcenc/echo11.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <m:echoRequest xmlns:m="urn:Echo">
   <m:in0>Yo Yo</m:in0>
  </m:echoRequest>
 </env:Body>
</env:Envelope>